let selectColor = prompt("Ընտրելով գույնը կտեղեկանաք լուսացույցի գույների նշանակությունների հետ (կարմիր,դեղին,կանաչ)", "կարմիր");

if (selectColor == "կարմիր") {
  alert ("Կարմիր ազդանշանի դեպքում, այդ թվում նաև՝ թարթող, արգելվում է երթևեկությունը։");
} else if (selectColor == "դեղին") {
  alert ("Դեղին ազդանշանն արգելում է երթևեկությունը և նախազգուշացնում ազդանշանի առաջիկա փոփոխման մասին։");
} else if(selectColor == "կանաչ") {
 alert (" Կանաչ ազդանշանը թույլատրում է երթևեկությունը։");
}
else {
alert ("Մուտքագրված տեքստը սխալ է։")
}


/*let info = (selectColor == "կարմիր") ? 'Կարմիր ազդանշանի դեպքում, այդ թվում նաև՝ թարթող, արգելվում է երթևեկությունը։' :
           (selectColor == "դեղին") ?  'Դեղին ազդանշանն արգելում է երթևեկությունը և նախազգուշացնում ազդանշանի առաջիկա փոփոխման մասին։' :
           (selectColor == "կանաչ") ? 'Կանաչ ազդանշանը թույլատրում է երթևեկությունը։':
           'Մուտքագրված տեքստը սխալ է։';

alert(info); */